In [2]:
import pandas as pd
import numpy as np
#https://www.w3resource.com/python-exercises/pandas/index-dataframe.php

In [3]:
#1 Write a Pandas program to get the powers of an array values element-wise
dict = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
df = pd.DataFrame(dict)
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [4]:
#2 Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index = labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [5]:
#3 Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [6]:
#4 4. Write a Pandas program to get the first 3 rows of a given DataFrame. 
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [7]:
#5 Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [8]:
#6 Write a Pandas program to select the specified columns and rows from a given data frame
# score qualify
# b 9.0 no
# d NaN no
# f 20.0 yes
# g 14.5 yes

df.iloc[[1,3,5,6], [1,3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [9]:
#7 Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2
df[df['attempts'] <2]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
j      Jonas   19.0         1     yes

In [10]:
#8 Write a Pandas program to count the number of rows and columns of a DataFrame
total_rows = len(df.axes[0])
total_cols = len(df.axes[1])
print(total_rows)
print(total_cols)

10
4

In [11]:
#9 Write a Pandas program to select the rows where the score is missing, i.e. is NaN
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [12]:
#11 Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15
df[(df['score'] >=15) & (df['attempts'] <2)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [13]:
#12 Write a Pandas program to change the score in row 'd' to 11.5
df['score']['d'] = 11.5
#or
df.loc['d', 'score'] = 11.5
df.head()

<ipython-input-13-61f64da6690d>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['score']['d'] = 11.5

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no

In [14]:
#13 Write a Pandas program to calculate the sum of the examination attempts by the students.
df['attempts'].sum()

19

In [15]:
#14 Write a Pandas program to calculate the mean score for each different student in DataFrame
df['score'].mean()

13.333333333333334

In [16]:
#16 Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.
df.sort_values(['name', 'score'], ascending = [False, True])

        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [17]:
## Select the row where name is equal to "Emily"
df.loc[df['name'] == 'Emily']

    name  score  attempts qualify
e  Emily    9.0         2      no

In [18]:
#18 Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame
df['name'][df['name'] == 'James'] = "Suresh"
#or
df['name'].replace('James', 'Suresh')
df

<ipython-input-18-91a103f82926>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][df['name'] == 'James'] = "Suresh"

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [32]:
import pandas as pd
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
df.columns = ['Column1', 'Column2', 'Column3']
df.rename(columns = {'col1':'Column1', 'col2': 'Column2', 'col3': 'Column3'})

   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

In [40]:
#24 Write a Pandas program to select rows from a given DataFrame based on values in some columns. Rows for colum1 value == 4
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)

df.loc[df['col1'] == 4]

   col1  col2  col3
1     4     5     8
3     4     7     0

In [6]:
#29 Write a Pandas program to delete DataFrame row(s) based on given column value.
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
df = df[df['col2'] !=5]
df

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

In [7]:
#32 Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe. Go to the editor
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df.fillna(0)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes